Repository: ubershmekel/yatt
Catalog: yout/lib/src/localization/app_*.arb
Languages: ar, de, el, es, fr, he, it, ja, ko, pt, ru

# adviceHelp
source: Tap the 'Help' button if you don't know the answer
ar: اضغط على زر "المساعدة" إذا كنت لا تعرف الإجابة
de: Tippen Sie auf die Schaltfläche „Hilfe“, wenn Sie die Antwort nicht kennen
el: Πατήστε το κουμπί "βοήθεια" εάν δεν γνωρίζετε την απάντηση
es: Toque el botón 'Ayuda' si no sabe la respuesta
fr: Appuyez sur le bouton « Aide » si vous ne connaissez pas la réponse
he: ליחצו 'עזרה' אם אתם לא יודעים מה התשובה
it: Tocca il pulsante "Aiuto" se non conosci la risposta
ja: 答えがわからない場合は「ヘルプ」ボタンをタップしてください
ko: 답변을 모를 경우 '도움말' 버튼을 탭하세요.
pt: Toque no botão 'Ajuda' se você não souber a resposta
ru: Нажмите кнопку «Помощь», если не знаете ответа

# adviceNext
source: Tap the 'Next' button to skip this one
ar: اضغط على زر "التالي" لتخطي هذا الزر
de: Tippen Sie auf die Schaltfläche „Weiter“, um diesen Schritt zu überspringen
el: Πατήστε το κουμπί "Επόμενο" για να το παραλείψετε
es: Toque el botón 'Siguiente' para omitir este
fr: Appuyez sur le bouton « Suivant » pour ignorer celui-ci
he: ליחצו 'הבא' כדי לדלג
it: Tocca il pulsante "Avanti" per saltare questo
ja: これをスキップするには「次へ」ボタンをタップしてください
ko: 이 항목을 건너뛰려면 '다음' 버튼을 탭하세요.
pt: Toque no botão 'Avançar' para pular este
ru: Нажмите кнопку «Далее», чтобы пропустить этот шаг.

# adviceRecord
source: Tap the 'Speak' button then say your answer out loud
ar: اضغط على زر "التحدث" ثم قل إجابتك بصوت عالٍ
de: Tippen Sie auf die Schaltfläche „Sprechen“ und sagen Sie dann Ihre Antwort laut
el: Πατήστε το κουμπί "Μιλήστε" και πείτε την απάντησή σας δυνατά
es: Toca el botón 'Hablar' y luego di tu respuesta en voz alta.
fr: Appuyez sur le bouton « Parler », puis dites votre réponse à voix haute
he: ליחצו 'הקלט' ואז אמרו את התשובה בקול רם
it: Tocca il pulsante "Parla", quindi pronuncia la tua risposta ad alta voce
ja: 「話す」ボタンをタップして、答えを声に出して言ってください
ko: '말하기' 버튼을 탭한 후 큰 소리로 대답해 보세요.
pt: Toque no botão 'Falar' e diga sua resposta em voz alta
ru: Нажмите кнопку «Говорить», а затем произнесите ответ вслух.

# adviceReport
source: Tap the 'Report' button if you found a bug or a missing translation
ar: اضغط على زر "الإبلاغ" إذا وجدت خطأً أو ترجمة مفقودة
de: Tippen Sie auf die Schaltfläche „Melden“, wenn Sie einen Fehler oder eine fehlende Übersetzung gefunden haben
el: Πατήστε το κουμπί "Αναφορά" εάν εντοπίσατε ένα σφάλμα ή μια μετάφραση που λείπει
es: Toque el botón 'Informar' si encontró un error o falta una traducción
fr: Appuyez sur le bouton « Signaler » si vous avez trouvé un bug ou une traduction manquante
he: ליחצו 'דיווח' אם מצאתם באג או חסר תרגום
it: Tocca il pulsante "Segnala" se hai trovato un bug o una traduzione mancante
ja: バグや翻訳の不足を見つけた場合は、「報告」ボタンをタップしてください。
ko: 버그를 발견했거나 번역이 누락된 경우 '신고' 버튼을 탭하세요.
pt: Toque no botão 'Reportar' se você encontrar um bug ou uma tradução faltando
ru: Нажмите кнопку «Пожаловаться», если вы обнаружили ошибку или отсутствующий перевод.

# appTitle
source: You Are The Translator
ar: أنت المترجم
de: Sie sind der Übersetzer
el: Είσαι ο Μεταφραστής
es: Eres el traductor
fr: Vous êtes le traducteur
it: Tu sei il traduttore
ja: あなたが翻訳者です
ko: 당신은 번역가입니다
pt: Você é o tradutor
ru: Вы переводчик

source: Cool
ar: رائع
el: Δροσερός
es: Fresco
he: מגניב
it: Freddo
ja: いいね
ko: 시원한
pt: Legal
ru: Прохладный

# earnPoints
source: Earn points and track your progress
ar: كسب النقاط وتتبع التقدم المحرز الخاص بك
de: Sammeln Sie Punkte und verfolgen Sie Ihren Fortschritt
el: Κερδίστε πόντους και παρακολουθήστε την πρόοδό σας
es: Gana puntos y sigue tu progreso
fr: Gagnez des points et suivez vos progrès
he: לצבור נקודות ולעקוב אחר ההתקדמות שלך
it: Guadagna punti e monitora i tuoi progressi
ja: ポイントを獲得して進捗状況を追跡する
ko: 포인트를 적립하고 진행 상황을 추적하세요
pt: Ganhe pontos e acompanhe seu progresso
ru: Зарабатывайте баллы и отслеживайте свой прогресс

source: Got it
ar: فهمتها
de: Habe es
el: Το έπιασα
es: Entiendo
fr: J'ai compris
he: הבנתי
it: Fatto
ja: わかった
ko: 알았어요
pt: Entendi
ru: Понятно

source: Help
ar: يساعد
de: Helfen
el: Βοήθεια
es: Ayuda
fr: Aide
he: עזרה
it: Aiuto
ja: ヘルプ
ko: 돕다
pt: Ajuda
ru: Помощь

# helpImproveThisPlease
source: Help improve this level by reporting if you find a bug or a missing translation
ar: ساعد في تحسين هذا المستوى من خلال الإبلاغ إذا وجدت خطأً أو ترجمة مفقودة
de: Helfen Sie mit, dieses Niveau zu verbessern, indem Sie uns melden, wenn Sie einen Fehler oder eine fehlende Übersetzung finden
el: Βοηθήστε στη βελτίωση αυτού του επιπέδου αναφέροντας εάν εντοπίσετε σφάλμα ή λείπει μετάφραση
es: Ayude a mejorar este nivel informando si encuentra un error o falta una traducción
fr: Aidez à améliorer ce niveau en signalant si vous trouvez un bug ou une traduction manquante
it: Aiutaci a migliorare questo livello segnalando se trovi un bug o una traduzione mancante
ja: バグや翻訳の不足を見つけた場合は報告して、このレベルの向上にご協力ください。
ko: 버그나 누락된 번역을 발견하면 보고하여 이 수준을 개선하는 데 도움을 주세요.
pt: Ajude a melhorar este nível reportando se você encontrar um bug ou uma tradução faltando
ru: Помогите улучшить этот уровень, сообщив, если вы обнаружите ошибку или отсутствующий перевод.

source: In development
ar: في التنمية
de: In Entwicklung
el: Σε ανάπτυξη
es: En desarrollo
fr: En développement
he: בפיתוח
it: In sviluppo
ja: 開発中
ko: 개발 중
pt: Em desenvolvimento
ru: В развитие

# learnPhrases
source: Learn phrases by reciting them aloud
ar: تعلم العبارات من خلال قراءتها بصوت عالٍ
de: Lernen Sie Sätze, indem Sie sie laut aufsagen
el: Μάθετε φράσεις απαγγέλλοντάς τες δυνατά
es: Aprende frases recitándolas en voz alta.
fr: Apprenez des phrases en les récitant à haute voix
he: למד ביטויים על ידי דקלום בקול רם
it: Impara le frasi recitandole ad alta voce
ja: フレーズを声に出して暗唱して学習します
ko: 문구를 큰 소리로 낭송하여 학습하세요.
pt: Aprenda frases recitando-as em voz alta
ru: Изучай фразы, читая их вслух

source: Learning language
ar: تعلم اللغة
de: Sprache lernen
el: Εκμάθηση γλώσσας
es: Aprendiendo idioma
fr: Apprendre une langue
it: Imparare la lingua
ja: 言語の学習
ko: 언어 학습
pt: Aprendendo idioma
ru: Изучение языка

source: Let's start!
ar: لنبدأ!
de: Lasst uns beginnen!
el: Ας αρχίσουμε!
es: ¡Empecemos!
fr: Commençons!
he: יאללה להתחיל!
it: Iniziamo!
ja: はじめましょう！
ko: 시작하자!
pt: Vamos começar!
ru: Давайте начнем!

# modeDescriptionLean
source: Learn - listen and repeat
el: Μάθετε - ακούστε και επαναλάβετε
es: Aprende - escucha y repite
fr: Apprendre - écouter et répéter
it: Impara: ascolta e ripeti
ja: 学習 - 聞いて繰り返します
pt: Aprenda - ouça e repita

# modeDescriptionPlay
source: Play - listen and translate
el: Παίξτε - ακούστε και μεταφράστε
es: Reproducir - escuchar y traducir
fr: Jouer - écouter et traduire
it: Gioca: ascolta e traduci
ja: 再生 - 聞いて翻訳する
pt: Play - ouça e traduza

source: Native language
ar: اللغة الأم
de: Muttersprache
el: Μητρική γλώσσα
es: Lengua materna
fr: Langue maternelle
it: Madrelingua
ja: 母国語
ko: 모국어
pt: Língua materna
ru: Родной язык

source: Next
ar: التالي
de: Nächste
el: Επόμενο
es: Próximo
fr: Suivant
he: הבא
it: Prossimo
ja: 次
ko: 다음
pt: Próximo
ru: Следующий

source: Report
ar: تقرير
de: Bericht
el: Κανω ΑΝΑΦΟΡΑ
es: Informe
fr: Rapport
he: דיווח
it: Rapporto
ja: 報告
ko: 보고서
pt: Relatório
ru: Отчет

# selectLearnLanguageSubtitle
source: Select the language that you want to learn. You will be translating to and from this language.
ar: اختر اللغة التي تريد تعلمها. سوف تقوم بالترجمة من وإلى هذه اللغة.
de: Wählen Sie die Sprache aus, die Sie lernen möchten. Sie übersetzen in und aus dieser Sprache.
el: Επιλέξτε τη γλώσσα που θέλετε να μάθετε. Θα μεταφράζετε από και προς αυτήν τη γλώσσα.
es: Selecciona el idioma que deseas aprender. Estarás traduciendo hacia y desde este idioma.
fr: Sélectionnez la langue que vous souhaitez apprendre. Vous traduirez vers et depuis cette langue.
it: Seleziona la lingua che vuoi imparare. Tradurrai da e verso questa lingua.
ja: 学びたい言語を選択してください。この言語への、またはこの言語からの翻訳を行うことになります。
ko: 배우고 싶은 언어를 선택하세요. 귀하는 이 언어로 번역하거나 이 언어에서 번역하게 됩니다.
pt: Selecione o idioma que você deseja aprender. Você traduzirá de e para este idioma.
ru: Выберите язык, который вы хотите выучить. Вы будете переводить на этот язык и с него.

# selectLevel
source: Select a level
ar: حدد المستوى
de: Wählen Sie eine Ebene aus
el: Επιλέξτε ένα επίπεδο
es: Selecciona un nivel
fr: Sélectionnez un niveau
he: בחירת שלב
it: Seleziona un livello
ja: レベルを選択してください
ko: 레벨을 선택하세요
pt: Selecione um nível
ru: Выберите уровень

# selectNativeLanguageSubtitle
source: Choose a language that you understand well. You will be translating to and from this language.
ar: اختر لغة تفهمها جيدًا. سوف تقوم بالترجمة من وإلى هذه اللغة.
de: Wählen Sie eine Sprache, die Sie gut verstehen. Sie übersetzen in und aus dieser Sprache.
el: Επιλέξτε μια γλώσσα που καταλαβαίνετε καλά. Θα μεταφράζετε από και προς αυτήν τη γλώσσα.
es: Elija un idioma que entienda bien. Estarás traduciendo hacia y desde este idioma.
fr: Choisissez une langue que vous comprenez bien. Vous traduirez vers et depuis cette langue.
it: Scegli una lingua che capisci bene. Tradurrai da e verso questa lingua.
ja: 自分がよく理解できる言語を選択してください。この言語への、またはこの言語からの翻訳を行うことになります。
ko: 당신이 잘 이해할 수 있는 언어를 선택하세요. 귀하는 이 언어로 번역하거나 이 언어에서 번역하게 됩니다.
pt: Escolha um idioma que você entenda bem. Você traduzirá de e para este idioma.
ru: Выберите язык, который вы хорошо понимаете. Вы будете переводить на этот язык и с него.

source: Speak
ar: يتكلم
de: Sprechen
el: Μιλώ
es: Hablar
fr: Parler
he: הקלט
it: Parlare
ja: 話す
ko: 말하다
pt: Falar
ru: Говорить

# translateA1
source: A1 - Translate simple words
ar: A1 - ترجمة الكلمات البسيطة
de: A1 – Einfache Wörter übersetzen
el: Α1 - Μεταφράστε απλές λέξεις
es: A1 - Traducir palabras sencillas
fr: A1 – Traduire des mots simples
he: A1 - תרגום מילים
it: A1 - Tradurre parole semplici
ja: A1 - 簡単な単語を翻訳する
ko: A1 - 간단한 단어 번역
pt: A1 - Traduzir palavras simples
ru: A1 – Перевести простые слова

# translateA1B
source: A1B - Translate travel phrases
ar: A1B - ترجمة عبارات السفر
de: A1B – Reisephrasen übersetzen
el: A1B - Μετάφραση ταξιδιωτικών φράσεων
es: A1B - Traducir frases de viaje
fr: A1B – Traduire des phrases de voyage
it: A1B - Tradurre frasi di viaggio
ja: A1B - 旅行フレーズの翻訳
ko: A1B - 여행 문구 번역
pt: A1B - Traduza frases de viagens

# translateA2
source: A2 - Translate simple sentences
ar: A2 - ترجمة الجمل البسيطة
de: A2 – Einfache Sätze übersetzen
el: Α2 - Μεταφράστε απλές προτάσεις
es: A2 - Traducir frases sencillas
fr: A2 - Traduire des phrases simples
he: A2 - תרגום משפטים
it: A2 - Tradurre frasi semplici
ja: A2 - 簡単な文章を翻訳する
ko: A2 - 간단한 문장 번역
pt: A2 - Traduzir frases simples
ru: A2 – Перевести простые предложения

# translateB1
source: B1 - Translate tricky sentences
ar: B1 - ترجمة الجمل الصعبة
de: B1 – Übersetzen Sie knifflige Sätze
el: Β1 - Μεταφράστε δύσκολες προτάσεις
es: B1 - Traducir frases complicadas
fr: B1 – Traduire des phrases délicates
it: B1 - Traduci frasi complicate
ja: B1 - 難しい文章を翻訳する
ko: B1 - 까다로운 문장 번역
pt: B1 - Traduzir frases complicadas
ru: B1 – Перевести сложные предложения

# welcomeHandsFree
source: Hands-free language learning...
ar: تعلم اللغات بدون استخدام اليدين...
de: Freihändiges Sprachenlernen...
el: Εκμάθηση ξένων γλωσσών χωρίς χέρια...
es: Aprendizaje de idiomas manos libres...
fr: Apprentissage des langues mains libres...
he: תלמדו שפה באמצעות הקול שלכם...
it: Apprendimento delle lingue a mani libere...
ja: ハンズフリー語学学習...
ko: 핸즈프리 언어 학습...
pt: Aprendizagem de idiomas sem usar as mãos...
ru: Изучение языка без помощи рук...

# welcomeListen
source: Listen to a phrase in your native language
ar: استمع إلى عبارة بلغتك الأم
de: Hören Sie sich einen Satz in Ihrer Muttersprache an
el: Ακούστε μια φράση στη μητρική σας γλώσσα
es: Escuche una frase en su idioma nativo
fr: Écoutez une phrase dans votre langue maternelle
he: האזינו למשפט בשפת האם שלכם
it: Ascolta una frase nella tua lingua madre
ja: 母国語でフレーズを聞いてください
ko: 모국어로 된 문구를 들어보세요
pt: Ouça uma frase em seu idioma nativo
ru: Прослушайте фразу на родном языке

# welcomeSay
source: Then say it out loud in the language you're learning
ar: ثم قلها بصوت عالٍ باللغة التي تتعلمها
de: Sagen Sie es dann laut in der Sprache, die Sie lernen
el: Μετά πείτε το δυνατά στη γλώσσα που μαθαίνετε
es: Luego dilo en voz alta en el idioma que estás aprendiendo.
fr: Puis dis-le à voix haute dans la langue que tu apprends
he: ואז תאמרו את המשפט בשפה שאתם לומדים
it: Poi dillo ad alta voce nella lingua che stai imparando
ja: 次に、学習中の言語で大声で言ってください
ko: 그런 다음 배우고 있는 언어로 큰 소리로 말해보세요.
pt: Então diga em voz alta no idioma que você está aprendendo
ru: Затем скажите это вслух на языке, который вы изучаете.

# welcomeYouAreTheTranslator
source: You are the translator
ar: أنت المترجم
de: Sie sind der Übersetzer
el: Είσαι ο μεταφραστής
es: tu eres el traductor
fr: Vous êtes le traducteur
he: אתם המתרגמים
it: Tu sei il traduttore
ja: あなたは翻訳者です
ko: 당신은 번역가입니다
pt: Você é o tradutor
ru: Вы переводчик
